{{{header(docs/core,Richard Westhaver,ellis@rwest.io)}}}
#+EXPORT_FILE_NAME: index

#+begin_src shell :dir ~/dev/comp/core/ :results pp :exports results
  tokei -t=rust,lisp
#+end_src

#+RESULTS:
#+begin_example
===============================================================================
 Language            Files        Lines         Code     Comments       Blanks
===============================================================================
 Lisp                  156        19763        15193         2104         2466
-------------------------------------------------------------------------------
 Rust                  142        12407        10732          443         1232
 |- Markdown           101          804            0          709           95
 (Total)                          13211        10732         1152         1327
===============================================================================
 Total                 298        32170        25925         2547         3698
===============================================================================
#+end_example

- [[file:install.org][Install]] :: Install Guide

- [[file:tests.org][Tests]] :: Testing Guide

  - [[https://packy.compiler.company/report/cover/core/cover-index.html][Coverage]] :: Code Coverage Report

  - [[https://packy.compiler.company/report/trace/core.json][Trace]] :: Chrome-compatible trace

- [[file:notes.org][Notes]] :: Internal Notes

- [[file:todo.org][Todo]] :: project tasks

* [[file:app][APP]] 
App Docs

* [[file:lib][LIB]] 
Library Docs

* [[file:ffi.org][FFI]] 
FFI Docs

* [[file:api][API]] 
API Reference
